aaron-bond.better-comments
adpyke.codesnap
amlovey.shaderlabvscodefree
antfu.browse-lite
antfu.vite
anthropic.claude-code
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc
christian-kohler.path-intellisense
clinyong.vscode-css-modules
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
dsznajder.es7-react-js-snippets
eamodio.gitlens
esbenp.prettier-vscode
expo.vscode-expo-tools
formulahendry.code-runner
formulahendry.docker-explorer
foxundermoon.shell-format
hediet.debug-visualizer
jeff-hykin.better-cpp-syntax
k--kato.docomment
kleber-swf.unity-code-snippets
kuscamara.remove-unused-imports
mikestead.dotenv
ms-azuretools.vscode-docker
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.powershell
ms-vscode-remote.remote-containers
msjsdiag.vscode-react-native
njpwerner.autodocstring
openai.chatgpt
pkief.material-icon-theme
pranaygp.vscode-css-peek
redhat.vscode-yaml
shd101wyy.markdown-preview-enhanced
slevesque.shader
tamasfe.even-better-toml
usernamehw.errorlens
visualstudiotoolsforunity.vstuc
whizkydee.material-palenight-theme
wix.vscode-import-cost
yclepticstudios.unity-snippets
yoavbls.pretty-ts-errors
yzhang.markdown-all-in-one